Repository: mongodb/docs
Catalog: locale/*/LC_MESSAGES/about.po
Languages: es

source: About MongoDB Documentation
es: Acerca de la documentación de MongoDB

source: License
es: Licencia

source: Editions
es: Ediciones

source: In addition to the `MongoDB Manual <http://docs.mongodb.org/manual/#>`_, you can also access this content in the following editions:
es: Además del `Manual de MongoDB <http://docs.mongodb.org/manual/#>`_, puedes acceder a este contenido en las siguientes ediciones:

source: MongoDB Reference documentation is also available as part of `dash <http://kapeli.com/dash>`_. You can also access the :hardlink:`MongoDB Man Pages <manpages.tar.gz>` which are also distributed with the official MongoDB Packages.
es: La documentación de referencia de MongoDB también está disponible como parte de `dash <http://kapeli.com/dash>`_. Puedes también acceder a las :hardlink:`Páginas Man de MongoDB <manpages.tar.gz>` que también son distribuidas con los paquetes oficiales de MongoDB.

source: Version and Revisions
es: Versión y revisiones

source: This version of the manual reflects version |version| of MongoDB.
es: Esta versión del manual refleja la versión |version| de MongoDB.

source: See the `MongoDB Documentation Project Page <http://docs.mongodb.org>`_ for an overview of all editions and output formats of the MongoDB Manual. You can see the full revision history and track ongoing improvements and additions for all versions of the manual from its `GitHub repository <https://github.com/mongodb/docs>`_.
es: Consulta la `Página del proyecto de Documentación de MongoDB <http://docs.mongodb.org>`_ para tener una visión general de todas las ediciones y formatos del Manual de MongoDB. Puedes ver el historial completo de revisiones y dar seguimiento a todas las mejoras y adiciones en curso para todas las versiones del manual desde su `repositorio en GitHub <https://github.com/mongodb/docs>`_.

source: This edition reflects "|branch|" branch of the documentation as of the "|commit|" revision. This branch is explicitly accessible via "|hardlink|" and you can always reference the commit of the current manual in the :hardlink:`release.txt` file.
es: Esta edición refleja la rama "|branch|" de la documentación como de la revisión "|commit|". Esta rama es explícitamente accesible a través de "|hardlink|" y siempre puedes referirte al commit del actual manual en el archivo :hardlink:`release.txt`.

source: The most up-to-date, current, and stable version of the manual is always available at "http://docs.mongodb.org/manual/".
es: La versión más actualizada y estable del manual está siempre disponible en "http://docs.mongodb.org/manual/".

source: Report an Issue or Make a Change Request
es: Reportar un problema o realizar una solicitud de cambio

source: To report an issue with this manual or to make a change request, file a ticket at the `MongoDB DOCS Project on Jira <https://jira.mongodb.org/browse/DOCS>`_.
es: Para reportar un problema con este manual o hacer una solicitud de cambio, crea un ticket en el `Proyecto de JIRA de MongoDB DOCS <https://jira.mongodb.org/browse/DOCS>`_.

source: Contribute to the Documentation
es: Contribuir a la documentación

source: The entire documentation source for this manual is available in the `mongodb/docs repository <https://github.com/mongodb/docs>`_, which is one of the `MongoDB project repositories on GitHub <http://github.com/mongodb>`_.
es: Las fuentes de la documentación completa para este manual está disponible en el `repositorio mongodb/docs <https://github.com/mongodb/docs>`_, que es uno de los `repositorios del proyecto MongoDB en GitHub <http://github.com/mongodb>`_.

source: To contribute to the documentation, you can open a `GitHub account <https://github.com/>`_, fork the `mongodb/docs repository <https://github.com/mongodb/docs>`_, make a change, and issue a pull request.
es: Para contribuir a la documentación, puedes abrir una `cuenta en GitHub <https://github.com/>`_, bifurcar el `repositorio mongodb/docs <https://github.com/mongodb/docs>`_, realizar un cambio y enviar un pull request.

source: In order for the documentation team to accept your change, you must complete the `MongoDB Contributor Agreement <http://www.mongodb.com/contributor>`_.
es: Para que el equipo de documentación acepte tu cambio, debes completar el `Acuerdo de contribuidor de MongoDB <http://www.mongodb.com/contributor>`_.

source: You can clone the repository by issuing the following command at your system shell:
es: Puedes clonar el repositorio ejecutando el siguiente comando en el shell de tu sistema:

source: About the Documentation Process
es: Acerca del proceso de documentación

source: The MongoDB Manual uses `Sphinx <http://sphinx-doc.org//>`_, a sophisticated documentation engine built upon `Python Docutils <http://docutils.sourceforge.net/>`_. The original `reStructured Text <http://docutils.sourceforge.net/rst.html>`_ files, as well as all necessary Sphinx extensions and build tools, are available in the same repository as the documentation.
es: El Manual de MongoDB utiliza `Sphinx <http://sphinx-doc.org//>`_, un sofisticado motor de documentación construido en base a `Python Docutils <http://docutils.sourceforge.net/>`_. Los archivos `reStructured Text <http://docutils.sourceforge.net/rst.html>`_ originales, también como todas las extensiones necesarios de Sphinx y las herramientas de compilación, están disponibles en el mismo repositorio de la documentación.

source: For more information on the MongoDB documentation process, see:
es: Para mayor información del proceso de documentación de MongoDB, consulta:

source: If you have any questions, please feel free to open a :issue:`Jira Case <DOCS>`.
es: Si tienes alguna pregunta, no dudes en abrir un :issue:`caso en Jira <DOCS>`.
