Repository: mongodb/docs
Catalog: locale/*/LC_MESSAGES/release-notes.po
Languages: es

source: Release Notes
es: Notas de versión

source: Always install the latest, stable version of MongoDB. See :ref:`release-version-numbers` for more information.
es: Siempre instala la última versión estable de MongoDB. Consulta :ref:`release-version-numbers` para mayor información.

source: See the following release notes for an account of the changes in major versions. Release notes also include instructions for upgrade.
es: Consulta las siguientes notas de versión para saber de los cambios en versiones mayores. Las notas de versiones también incluyen instrucciones de actualización.

source: Current Stable Release
es: Actual versión estable

source: Previous Stable Releases
es: Versiones estables previas

source: MongoDB Version Numbers
es: Números de versiones de MongoDB

source: For MongoDB ``2.4.1``, ``2.4`` refers to the release series and ``.1`` refers to the revision. The second component of the release series (e.g. ``4`` in ``2.4.1``) describes the type of release series. Release series ending with even numbers (e.g. ``4`` above) are *stable* and ready for production, while odd numbers are for *development* and testing only.
es: Para MongoDB ``2.4.1``, ``2.4`` se refiere a la serie de versión y ``.1`` se refiere a la revisión. El segundo componente de la serie de versión (por ejemplo ``4`` in ``2.4.1``) describe el tipo de serie de versión. Las series de versión que terminan con un número par (por ejemplo ``4`` en el anterior) son *estables* y están listas para producción, mientras que números impares son para *desarrollo* y pruebas solamente.

source: Generally, changes in the release series (e.g. ``2.2`` to ``2.4``) mark the introduction of new features that may break backwards compatibility. Changes to the revision number mark the release bug fixes and backwards-compatible changes.
es: Generalmente, los cambios en las series de versión (por ejemplo ``2.2`` a ``2.4``) definen una introducción de nuevas características que podrían quebrar compatibilidad hacia atrás. Los cambios al número de revisión definen ajustes de errores de la versión y cambios compatibles hacia atrás.

source: Always upgrade to the latest stable revision of your release series.
es: Siempre actualiza a la última versión estable de tu serie de versión.

source: The version numbering system for MongoDB differs from the system used for the MongoDB drivers. Drivers use only the first number to indicate a major version. For details, see :ref:`drivers-version-numbers`.
es: El sistema de numeración de versiones para MongoDB difiere del sistema usado por los drivers de MongoDB. Los drivers usan solamente el primer número para indicar una versión mayor. Para más detalles, consulta :ref:`drivers-version-numbers`.

source: 2.0.0 : Stable release.
es: 2.0.0 : Versión estable.

source: 2.0.1 : Revision.
es: 2.0.1 : Revisión.

source: 2.1.0 : Development release *for testing only*. Includes new features and changes for testing. Interfaces and stability may not be compatible in development releases.
es: 2.1.0 : Versión de desarrollo *sólo para pruebas*. Incluye nuevas características y cambio para pruebas. Las interfaces y la estabilidad podrían no ser compatibles en versiones de desarrollo.

source: 2.2.0 : Stable release. This is a culmination of the 2.1.x development series.
es: 2.2.0 : Versión estable. Esta es una culminación de la serie de desarrollo 2.1.x.
