Repository: mongodb/docs
Catalog: locale/*/LC_MESSAGES/tutorial/force-member-to-*-primary.po
Languages: be

source: Force a Member to Become Primary
be: 强制指定某个节点为主节点

source: A majority of the configured members of a replica set *must* be available for a set to reconfigure a set or elect a primary. See :doc:`/core/replica-set-elections` for more information.
be: 关于优先级的更多信息，请参考 :data:`~local.system.replset.members[n].priority` 。

source: This procedure assumes your current :term:`primary` is ``m1.example.net`` and that you'd like to instead make ``m3.example.net`` primary. The procedure also assumes you have a three-member :term:`replica set` with the configuration below. For more information on configurations, see :ref:`Replica Set Configuration Use <replica-set-reconfiguration-usage>`.
be: 假设我们现在的 :term:`primary` 是 ``m1.example.net`` ，我们想将 ``m3.example.net`` 变为主节点。假设我们的 :term:`replica set` 由如下配置的三个节点组成。有关复制集配置的更多信息，参见 :ref:`Replica Set Configuration Use <replica-set-reconfiguration-usage>` 。

source: This procedure assumes this configuration:
be: 复制集配置如下：

source: In a :program:`mongo` shell connected to the primary, use the following sequence of operations to make ``m3.example.net`` the primary:
be: 在 :program:`mongo` 窗口中，使用如下的命令来让 ``m3.example.net`` 成为主节点。

source: The following sequence of events occur:
be: 将会发生下面这些事件：

source: ``m3.example.net`` and ``m2.example.net`` sync with ``m1.example.net`` (typically within 10 seconds).
be: ``m3.example.net`` 和 ``m2.example.net`` 从 ``m1.example.net`` 复制数据 （一般在10秒内）。

source: ``m1.example.net`` sees that it no longer has highest priority and, in most cases, steps down. ``m1.example.net`` *does not* step down if ``m3.example.net``'s sync is far behind. In that case, ``m1.example.net`` waits until ``m3.example.net`` is within 10 seconds of its optime and then steps down. This minimizes the amount of time with no primary following failover.
be: ``m1.example.net`` 发现自己不是最高优先级的节点了，一般会辞职降级。当``m3.example.net`` 的数据比其落后很多的时候，``m1.example.net`` 将 *不会* 降级。本次测试中，``m1.example.net`` 会等到 ``m3.example.net`` 的optime 落后其小于10秒时降职。这是在没有主节点发生故障的时候最小的时间需求。

source: The step down forces on election in which ``m3.example.net`` becomes primary based on its :data:`priority <replSetGetConfig.members[n].priority>` setting.
be: 由于``m3.example.net`` 的 :data:`priority <local.system.replset.members[n].priority>` 设定，会降职选举 ``m3.example.net`` 为新的主节点。

source: Optionally, if ``m3.example.net`` is more than 10 seconds behind ``m1.example.net``'s optime, and if you don't need to have a primary designated within 10 seconds, you can force ``m1.example.net`` to step down by running:
be: 如果 ``m3.example.net`` 落后于 ``m1.example.net`` 超过10秒，或者我们10秒内都不需要新的主节点，我们可以通过如下操作让 ``m1.example.net`` 辞职：

source: This prevents ``m1.example.net`` from being primary for 86,400 seconds (24 hours), even if there is no other member that can become primary. When ``m3.example.net`` catches up with ``m1.example.net`` it will become primary.
be: 这将防止 ``m1.example.net`` 在86400秒（24小时）内成为主节点，即使没有其他节点成为主节点。当 ``m3.example.net`` 追上 ``m1.example.net`` 的时候，其将成为主节点。

source: If you later want to make ``m1.example.net`` primary again while it waits for ``m3.example.net`` to catch up, issue the following command to make ``m1.example.net`` seek election again:
be: 如果我们希望让 ``m1.example.net`` 在 ``m3.example.net`` 追赶的时候重新成为主节点，可以使用如下命令：

source: Force a Member to be Primary Using Database Commands
be: 通过数据库命令强制某个节点成为主节点

source: Consider a :term:`replica set` with the following members:
be: 假设我们 :term:`replica set` 中有如下成员：

source: ``mdb0.example.net`` - the current :term:`primary`.
be: ``mdb0.example.net`` - 现在的 :term:`primary` 。

source: ``mdb1.example.net`` - a :term:`secondary`.
be: ``mdb1.example.net`` - 一个 :term:`secondary` 。

source: ``mdb2.example.net`` - a secondary .
be: ``mdb2.example.net`` - 一个 secondary 。

source: To force a member to become primary use the following procedure:
be: 通过如下流程来强制某个节点成为主节点：

source: In a :program:`mongo` shell, run :method:`rs.status()` to ensure your replica set is running as expected.
be: 在 :program:`mongo` 窗口中，执行 :method:`rs.status()` 来确定我们的复制集状态。

source: In a :program:`mongo` shell connected to the :program:`mongod` instance running on ``mdb2.example.net``, freeze ``mdb2.example.net`` so that it does not attempt to become primary for 120 seconds.
be: 连接到 ``mdb2.example.net`` ，并在 :program:`mongo` 窗口中 ，将 ``mdb2.example.net`` 冻结，使其无法在120秒内成为主节点。

source: In a :program:`mongo` shell connected the :program:`mongod` running on ``mdb0.example.net``, step down this instance that the :program:`mongod` is not eligible to become primary for 120 seconds:
be: 连接到 ``mdb0.example.net`` ，并在 :program:`mongo` 窗口中使其降职，并无法在120秒内成为主节点：

source: ``mdb1.example.net`` becomes primary.
be: ``mdb1.example.net`` 成为主节点。

source: During the transition, there is a short window where the set does not have a primary.
be: 在转变过程中，可能会有极短暂的时间会出现没有主节点的情况出现。
