Repository: mongodb/docs
Catalog: locale/*/LC_MESSAGES/tutorial/text-search-with-rlp.po
Languages: ksh

source: Text Search with Basis Technology Rosette Linguistics Platform
ksh: 使用基本技术Rosette语义平台的文本索引

source: On this page
ksh: 本页内容

source: Enterprise Feature
ksh: 企业功能

source: Available in MongoDB Enterprise only.
ksh: 只在MongoDB企业版中提供。

source: Overview
ksh: 概述

source: In addition to the languages supported by text search in MongoDB, MongoDB Enterprise provides support for the following additional languages: Arabic, Farsi (specifically Dari and Iranian Persian dialects), Urdu, Simplified Chinese, and Traditional Chinese.
ksh: 除了MongoDB文本检索中支持的语言，MongoDB企业版提供了下列其它语言的支持：Arabic, Farsi (具体为Dari 和 Iranian Persian 方言), Urdu, 简体中文以及繁体中文。

source: To provide support for these six additional languages, MongoDB Enterprise integrates Basis Technology Rosette Linguistics Platform (RLP) to perform normalization, word breaking, sentence breaking, and stemming or tokenization depending on the language.
ksh: 为了支持对这些6中其它语言的支持，MongoDB企业版集成了基础技术Rosette 语义平台（RLP）根据语言来进行正规化、分词、断句、词干和分词。

source: MongoDB Enterprise supports RLP SDK 7.11.1 on Red Hat Enterprise Linux 6.x. For information on providing support on other platforms, contact your sales representative.
ksh: Red Hat 企业版 Linux 6.x 上的MongoDB企业版支持 RLP SDK 7.11.1。了解其它平台上支持语言的更多信息，联系您的销售代表。

source: Prerequisites
ksh: 预先准备

source: To use MongoDB with RLP, MongoDB requires a license for the Base Linguistics component of RLP and one or more languages specified above. MongoDB does not require a license for all six languages listed above.
ksh: 在MongoDB中使用RLP，MongoDB需要一个RLP基础语义组件的许可证，用于上面指定的一种或多种语言。MongoDB不需要上面列举的所有六种语言的许可证。

source: Support for any of the specified languages is conditional on having a valid RLP license for the language. For instance, if there is only an RLP license provided for Arabic, then MongoDB will only enable support for Arabic and will not enable support for any other RLP based languages. For any language which lacks a valid license, the MongoDB log will contain a warning message. Additionally, you can set the MongoDB log verbosity level to ``2`` to log debug messages that identify each supported language.
ksh: 对任意一种指定语言的支持依赖于有一个针对该语言有效的RLP许可证。例如，如果只有一个为阿拉伯语提供的RLP许可证，那么MongoDB将会提供对阿拉伯语的支持，而不会提供对其它基于RLP语言的支持。对于其它缺少有效许可证的语言，MongoDB的日志将会提供一个警报信息。此外。您可以将MongoDB日志的显示级别设置为 ``2`` 来将识别每种支持语言的调试信息记录下来。

source: You do not need the Language Extension Pack as MongoDB does not support these RLP languages at this time.
ksh: 您不需要语言拓展包，因为MongoDB暂时不支持这些RLP语言。

source: Contact Basis Technology at info@basistech.com to get a copy of RLP and a license for one or more languages. For more information on how to contact Basis Technology, see http://www.basistech.com/contact/.
ksh: 联系基础技术info@basistech.com 以得到RLP的备份以及一种或更多语言的许可证。查阅 http://www.basistech.com/contact/ 了解更多关于如何联系基础技术部门的信息。

source: Procedure
ksh: 流程

source: Additional Information
ksh: 其它信息

source: For installation help, see the RLP Quick Start manual or Chapter 2 of the Rosette Linguistics Platform Application Developer’s Guide.
ksh: 查阅RLP快速启动手册或者Rosette 语义平台应用开发者手册的第二章来获取安装帮助。

source: For debugging any RLP specific issues, you can set the ``rlpVerbose`` parameter to ``true`` (i.e. ``--setParameter rlpVerbose=true``) to view ``INFO`` messages from RLP.
ksh: 为了调试任何RLP相关的问题，您可以设置 ``rlpVerbose`` 参数为 ``true`` （例如， ``--setParameter rlpVerbose=true`` ）来查看RLP中的 ``INFO`` 消息。

source: Enabling ``rlpVerbose`` has a performance overhead and should only be enabled for troubleshooting installation issues.
ksh: 允许 ``rlpVerbose`` 会有一个性能支出，应该只在安装问题的疑难排除时启用。
